Documents/ПоступлениеГрузов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ПоступлениеГрузов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УчетГрузов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипСклада</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ_Грузы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Груз</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Грузы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Судно</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Судна</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоступления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокХранения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПоступлениеГрузов/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПоступлениеГрузов.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПоступлениеГрузов.Дата,
	|	ПоступлениеГрузов.Номер,
	|	ПоступлениеГрузов.Ответственный,
	|	ПоступлениеГрузов.Склад,
	|	ПоступлениеГрузов.ТЧ_Грузы.(
	|		НомерСтроки,
	|		Груз,
	|		Судно,
	|		ДатаПоступления,
	|		СрокХранения
	|	)
	|ИЗ
	|	Документ.ПоступлениеГрузов КАК ПоступлениеГрузов
	|ГДЕ
	|	ПоступлениеГрузов.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТЧ_ГрузыШапка = Макет.ПолучитьОбласть("ТЧ_ГрузыШапка");
	ОбластьТЧ_Грузы = Макет.ПолучитьОбласть("ТЧ_Грузы");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТЧ_ГрузыШапка);
		ВыборкаТЧ_Грузы = Выборка.ТЧ_Грузы.Выбрать();
		Пока ВыборкаТЧ_Грузы.Следующий() Цикл
			ОбластьТЧ_Грузы.Параметры.Заполнить(ВыборкаТЧ_Грузы);
			ТабДок.Вывести(ОбластьТЧ_Грузы, ВыборкаТЧ_Грузы.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
